[
    {
        "title": "Freshman Social Camp (FSC)",
        "desc": "FSC is crafted to kickstart your university journey with enduring friendships and unforgettable experiences. Engage in a variety of physical and intellectual games, participate in team bonding exercises, and compete for exciting team and individual prizes. You will also have the opportunity to attend the beach finale event Bash together with your new friends, solidifying your friendships.",
        "date": "19th June - 22nd June 2024",
        "imgSrc": "announcements/fsc.jpg",
        "link": "./events/freshman_social_camp"
    },
    {
        "title": "Freshman Orientation Week (FOW)",
        "desc": "FOW is a 4-day physical orientation camp where seniors help freshmen adapt to different aspects of university life through preparatory talks and team-building activities. Forge lasting friendships as you navigate campus resources and academic challenges together. Look forward to strategic team games that develop you both intellectually and physically.",
        "date": "24th July - 27th July 2024",
        "imgSrc": "announcements/fow.jpg",
        "link": "./events/freshman_orientation_camp"
    },
    {
        "title": "Freshman Finale Camp (FFC)",
        "desc": "FFC is a 3-day physical summer camp, perfectly tailored for international students gearing up for matriculation closer to August. The camp offers an array of theme-based activities such as flag-building and exhilarating house face-offs. Engage in friendly competition alongside your housemates, strategizing to earn glory for your elemental faction in a series of thrilling challenges. End the camp on a high note with its campfire and barbecue finale under the stars.",
        "date": "5th August - 7th August 2024",
        "imgSrc": "announcements/ffc.jpg",
        "link": "./events/freshman_finale_camp"
    },
    {
        "title": "Computing Bash",
        "desc": "FFC is a 3-day physical summer camp, perfectly tailored for international students gearing up for matriculation closer to August. The camp offers an array of theme-based activities such as flag-building and exhilarating house face-offs. Engage in friendly competition alongside your housemates, strategizing to earn glory for your elemental faction in a series of thrilling challenges. End the camp on a high note with its campfire and barbecue finale under the stars.",
        "date": "16th August 2024",
        "imgSrc": "announcements/bash.jpg",
        "link": "./events/computing_bash"
    }
]
