[
  {
    "title": "Rag & Flag",
    "desc": "Rag and Flag is an annual event at NUS that brings together students from various faculties to participate in community service and fundraising activities. The day begins with students engaging in volunteer work across different locations, followed by a vibrant parade featuring student performances and creatively decorated floats. This event not only fosters a sense of unity and social responsibility among students but also helps raise funds for various charitable causes. Rag and Flag embodies the spirit of giving back to the community while celebrating student creativity and teamwork.",
    "date": "10/08/24",
    "link": "./events/rag_and_flag",
    "imgSrc": "/announcements/rag_and_flag.jpg"
  },
  {
    "title": "Freshman Finale Camp",
    "desc": "FFC is a 3-day physical summer camp, perfectly tailored for international students gearing up for matriculation closer to August. The camp offers an array of theme-based activities such as flag-building and exhilarating house face-offs. Engage in friendly competition alongside your housemates, strategizing to earn glory for your elemental faction in a series of thrilling challenges. End the camp on a high note with its campfire and barbecue finale under the stars.",
    "date": "05/08/24 - 07/08/24",
    "link": "./events/freshman_finale_camp",
    "imgSrc": "/announcements/ffc.jpg"
  },
  {
    "title": "Computing Bash",
    "desc": "A fun-filled beach finale event where freshmen and seniors come together to wrap up the entire orientation experience with a night of performances, games, and food. Held at Sentosa Beach, Bash 2024 offers an electrifying atmosphere with DJ sets, inflatable obstacle courses, and much more.",
    "date": "16/08/24",
    "link": "./events/computing_bash",
    "imgSrc": "/announcements/bash.jpg"
  },
  {
    "title": "Computing Day",
    "desc": "Join us for Computing Day 2024, a festive celebration of community and technology at NUS, orchestrated by the Students' Computing Club and the Student Life Office. This year’s theme, 'Code & Chill,' invites you to relax and engage with various activities including coding competitions, VR gaming, and student projects. Celebrate the spirit of SoC with food, games, and great company, all set for August 14, 2024, at COM3 MPH.",
    "date": "4/09/24",
    "link": "./events/computing_day",
    "imgSrc": "/announcements/computing_day.png"
  },
  {
    "title": "Elections 2024",
    "desc": "The annual Computing Club Elections are back! This year, we are looking for passionate individuals to join the club's Executive Committee and make a difference in the computing community. If you are interested in taking on a leadership role and contributing to the club's growth, stay tuned for more information on the election process and how you can get involved.",
    "date": "Check the elections page for more details",
    "link": "./elections",
    "imgSrc": "/announcements/elections.jpg"
  }
]
