{
  "flag-vday-sales": {
    "title": "Flag Valentine's Day Sales",
    "body": "The SOC Flag Valentine’s Day Sales is an annual fundraiser offering real flowers (single stems or bouquets), photobooth polaroids, and charming items like plushies, keychains, and pins. Proceeds support our beneficiary, making it a meaningful way to celebrate Valentine’s Day.",
    "link": "flag-vday-sales",
    "imgSrc": "/announcements/flag-vday.jpg",
    "startDatetime": "2025-02-13T09:00:00",
    "endDatetime": "2025-02-14T18:00:00"
  },
  "career-launchpad": {
    "title": "Career Launchpad",
    "body": "Career Launchpad 2025 is an initiative by the NUS Computing Club's Academic Liaison Cell aimed at preparing students for successful careers. It includes skill-building workshops, company talks, and alumni sharing sessions, focusing on delivering insights and meaningful takeaways to empower attendees in their career journeys.",
    "link": "career-launchpad",
    "imgSrc": "/announcements/career-launchpad.png",
    "startDatetime": "2025-02-03T09:00:00",
    "endDatetime": "2025-02-07T17:00:00"
  },
  "meliorium": {
    "title": "Meliorium",
    "body": "Meliorium is an initiative which extends support to newcomers and international students. Through engaging activities such as an Amazing Race around campus and various station games, Meliorium provides opportunities for participants to broaden their social connections, learn about different cultures, and familiarise themselves with the unique culture and physical layout of SoC.",
    "link": "meliorium",
    "imgSrc": "/announcements/meliorium.png",
    "startDatetime": "2025-01-15T09:00:00",
    "endDatetime": "2025-01-18T17:00:00"
  },
  "comaraderie": {
    "title": "COMaraderie",
    "body": "Comaraderie is an annual event held by SoC to help students kickstart the new semester with new friendships and experiences after the long winter break. Participants form groups of 5 and complete various challenges to win attractive prizes, making new friends along the way.",
    "link": "comaraderie",
    "imgSrc": "/announcements/comaraderie.png",
    "startDatetime": "2025-01-20T09:00:00",
    "endDatetime": "2025-01-31T17:00:00"
  },
  "ewp": {
    "title": "Exam Welfare Pack Distribution",
    "body": "Mark your calendars for our Exam Welfare Pack distribution!",
    "link": "ewp",
    "imgSrc": "/announcements/ewp.png",
    "startDatetime": "2025-01-20T09:00:00",
    "endDatetime": "2025-01-31T17:00:00"
  }
}
