{
  "freshman_finale_camp": {
    "title": "Freshman Finale Camp",
    "body": "Theme: Elementals: Rediscover your inner element\n\nAbstract: FFC is a 3-day physical summer camp, perfectly tailored for international students gearing up for matriculation closer to August. The camp offers an array of theme-based activities such as flag-building and exhilarating house face-offs. Engage in friendly competition alongside your housemates, strategizing to earn glory for your elemental faction in a series of thrilling challenges. End the camp on a high note with its campfire and barbecue finale under the stars.\n\nSignup links will be released soon! Stay tuned!\n",
    "link": "freshman_finale_camp",
    "imgSrc": "/announcements/ffc.jpg",
    "startDatetime": "2024-08-05T09:00:00",
    "endDatetime": "2024-08-07T17:00:00"
  },
  "computing_bash": {
    "title": "Computing Bash",
    "body": "A fun-filled beach finale event where freshmen and seniors come together to wrap up the entire orientation experience with a night of performances, games, and food. Held at Sentosa Beach, Bash 2024 offers an electrifying atmosphere with DJ sets, inflatable obstacle courses, and much more.\n\nSignup links will be released soon! Stay tuned!\n",
    "link": "computing_bash",
    "imgSrc": "/announcements/bash.jpg",
    "startDatetime": "2024-08-16T09:00:00",
    "endDatetime": "2024-08-16T23:59:59"
  },
  "computing_day": {
    "title": "Computing Day",
    "body": "Computing Day 2024 is a vibrant celebration organized by the NUS Students' Computing Club and the Student Life Office, scheduled for August 14, 2024, at COM3 MPH, NUS. Under the theme \"Code & Chill,\" this event aims to foster community spirit and pride among students, staff, and alumni of the School of Computing (SoC). The day is packed with activities that highlight the computing culture, including a mix of technical showcases and fun-filled engagements like a coding competition, VR gaming, student project exhibits, and traditional carnival games.\n\nThe event welcomes all NUS members, focusing on encouraging student involvement and showcasing innovations from various Student Interest Groups (SIGs). Highlights include the opening ceremony with the Dean, a coding competition prize ceremony, and a closing ceremony that recaps the day's events. Additional attractions such as food booths, photobooths, and a merchandise booth ensure that there’s something for everyone.\n\nDesigned to build a bridge between students, faculty, and alumni, Computing Day 2024 will provide a platform for showcasing computing projects, sharing experiences, and promoting an inclusive culture within SoC. With comprehensive planning and the participation of key stakeholders, the event is set to be a memorable day that celebrates the essence and excitement of computing at NUS.\n",
    "link": "computing_day",
    "imgSrc": "/announcements/computing_day.png",
    "startDatetime": "2024-08-14T09:00:00",
    "endDatetime": "2024-08-14T17:00:00"
  }
}
